In [1]:
import pandas as pd

In [2]:
# Create data frame
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  year  reports  coverage
Cochice     Jason  2012        4        25
Pima        Molly  2012       24        94
Santa Cruz   Tina  2013       31        57
Maricopa     Jake  2014        2        62
Yuma          Amy  2014        3        70

In [3]:
# view name column
df['name']

Cochice       Jason
Pima          Molly
Santa Cruz     Tina
Maricopa       Jake
Yuma            Amy
Name: name, dtype: object

In [4]:
# view 2 columns
df[['name', 'reports']]

             name  reports
Cochice     Jason        4
Pima        Molly       24
Santa Cruz   Tina       31
Maricopa     Jake        2
Yuma          Amy        3

In [5]:
# View first 2 rows
df[:2]

          name  year  reports  coverage
Cochice  Jason  2012        4        25
Pima     Molly  2012       24        94

In [6]:
# view rows where coverage > 50
df[df['coverage'] > 50]

             name  year  reports  coverage
Pima        Molly  2012       24        94
Santa Cruz   Tina  2013       31        57
Maricopa     Jake  2014        2        62
Yuma          Amy  2014        3        70

In [7]:
# View Rows Where Coverage Is Greater Than 50 And Reports Less Than 4
df[(df['coverage']  > 50) & (df['reports'] < 4)]

          name  year  reports  coverage
Maricopa  Jake  2014        2        62
Yuma       Amy  2014        3        70